artillery/Artillery tests results.txt
wojci@MSI MINGW64 ~/Desktop/GoIT HW/Cypress (main)
$ artillery run artillery/axolotl_test.yml
Test run id: tqprb_73wagnwhgjjkzeraxz4958jw4ec7h_gnz6
Phase started: unnamed (index: 0, duration: 60s) 20:51:57(+0200)

--------------------------------------
Metrics for period to: 20:52:00(+0200) (width: 1.323s)
--------------------------------------

errors.Failed capture or match: ................................................ 15
http.codes.404: ................................................................ 15
http.downloaded_bytes: ......................................................... 18781
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 16
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 31
  mean: ........................................................................ 28.9
  median: ...................................................................... 29.1
  p95: ......................................................................... 30.3
  p99: ......................................................................... 30.3
http.responses: ................................................................ 15
vusers.created: ................................................................ 16
vusers.created_by_name.0: ...................................................... 16
vusers.failed: ................................................................. 15


--------------------------------------
Metrics for period to: 20:52:10(+0200) (width: 9.977s)
--------------------------------------

errors.Failed capture or match: ................................................ 100
http.codes.404: ................................................................ 100
http.downloaded_bytes: ......................................................... 125498
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 46
  mean: ........................................................................ 29.3
  median: ...................................................................... 29.1
  p95: ......................................................................... 32.1
  p99: ......................................................................... 40
http.responses: ................................................................ 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:52:20(+0200) (width: 9.985s)
--------------------------------------

errors.Failed capture or match: ................................................ 100
http.codes.404: ................................................................ 100
http.downloaded_bytes: ......................................................... 125346
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 48
  mean: ........................................................................ 29.2
  median: ...................................................................... 29.1
  p95: ......................................................................... 32.1
  p99: ......................................................................... 32.8
http.responses: ................................................................ 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:52:30(+0200) (width: 9.982s)
--------------------------------------

errors.Failed capture or match: ................................................ 100
http.codes.404: ................................................................ 100
http.downloaded_bytes: ......................................................... 124700
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 28
  max: ......................................................................... 61
  mean: ........................................................................ 30.2
  median: ...................................................................... 29.1
  p95: ......................................................................... 34.1
  p99: ......................................................................... 44.3
http.responses: ................................................................ 100
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 100


--------------------------------------
Metrics for period to: 20:52:40(+0200) (width: 9.944s)
--------------------------------------

errors.Failed capture or match: ................................................ 96
http.codes.404: ................................................................ 96
http.downloaded_bytes: ......................................................... 94772
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 139
  mean: ........................................................................ 32.7
  median: ...................................................................... 29.1
  p95: ......................................................................... 32.8
  p99: ......................................................................... 138.4
http.responses: ................................................................ 96
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 96


--------------------------------------
Metrics for period to: 20:52:50(+0200) (width: 9.986s)
--------------------------------------

errors.Failed capture or match: ................................................ 104
http.codes.404: ................................................................ 104
http.downloaded_bytes: ......................................................... 114277
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 275
  mean: ........................................................................ 36.6
  median: ...................................................................... 29.1
  p95: ......................................................................... 39.3
  p99: ......................................................................... 141.2
http.responses: ................................................................ 104
vusers.created: ................................................................ 100
vusers.created_by_name.0: ...................................................... 100
vusers.failed: ................................................................. 104


Phase completed: unnamed (index: 0, duration: 60s) 20:52:57(+0200)

--------------------------------------
Metrics for period to: 20:53:00(+0200) (width: 8.253s)
--------------------------------------

errors.Failed capture or match: ................................................ 85
http.codes.404: ................................................................ 85
http.downloaded_bytes: ......................................................... 106795
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 84
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 36
  mean: ........................................................................ 29
  median: ...................................................................... 29.1
  p95: ......................................................................... 30.9
  p99: ......................................................................... 34.1
http.responses: ................................................................ 85
vusers.created: ................................................................ 84
vusers.created_by_name.0: ...................................................... 84
vusers.failed: ................................................................. 85


All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 20:53:00(+0200)
--------------------------------

errors.Failed capture or match: ................................................ 600
http.codes.404: ................................................................ 600
http.downloaded_bytes: ......................................................... 580139
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 275
  mean: ........................................................................ 31.2
  median: ...................................................................... 29.1
  p95: ......................................................................... 32.8
  p99: ......................................................................... 120.3
http.responses: ................................................................ 600
vusers.created: ................................................................ 600
vusers.created_by_name.0: ...................................................... 600
vusers.failed: ................................................................. 600

wojci@MSI MINGW64 ~/Desktop/GoIT HW/Cypress (main)